20220129113922-risp.org
:PROPERTIES:
:ID:       9c018eb8-23a2-4632-be01-45f8d0c08073
:END:
#+title: risp
#+filetags: :Project:
* 概要
eccentric projectのコードを元に、Ruby上でLispを実装する。
最低限かつテストがないので、整備して使えるようにする。

ゴール: おみくじスクリプトを書けるようにする。
* Memo
* Tasks
** TODO [[https://tatsu-zine.com/samples/free/scheme-in-ruby.pdf][作って学ぶプログラミング言語]]
:LOGBOOK:
CLOCK: [2022-04-29 Fri 22:59]--[2022-04-29 Fri 23:24] =>  0:25
CLOCK: [2022-04-29 Fri 22:01]--[2022-04-29 Fri 22:26] =>  0:25
CLOCK: [2022-04-29 Fri 21:27]--[2022-04-29 Fri 21:52] =>  0:25
CLOCK: [2022-04-29 Fri 20:20]--[2022-04-29 Fri 20:45] =>  0:25
CLOCK: [2022-04-29 Fri 18:36]--[2022-04-29 Fri 19:01] =>  0:25
CLOCK: [2022-04-29 Fri 18:02]--[2022-04-29 Fri 18:27] =>  0:25
CLOCK: [2022-04-29 Fri 15:01]--[2022-04-29 Fri 15:26] =>  0:25
:END:
RubyでSchemeを実装する。
** TODO 既存部分のテスト追加する
:LOGBOOK:
CLOCK: [2022-01-30 Sun 22:44]--[2022-01-30 Sun 23:09] =>  0:25
CLOCK: [2022-01-30 Sun 21:58]--[2022-01-30 Sun 22:23] =>  0:25
CLOCK: [2022-01-30 Sun 21:22]--[2022-01-30 Sun 21:47] =>  0:25
CLOCK: [2022-01-30 Sun 14:04]--[2022-01-30 Sun 14:29] =>  0:25
CLOCK: [2022-01-30 Sun 13:31]--[2022-01-30 Sun 13:56] =>  0:25
CLOCK: [2022-01-30 Sun 13:05]--[2022-01-30 Sun 13:30] =>  0:25
CLOCK: [2022-01-23 Sun 23:50]--[2022-01-24 Mon 00:15] =>  0:25
CLOCK: [2022-01-23 Sun 23:14]--[2022-01-23 Sun 23:39] =>  0:25
CLOCK: [2022-01-23 Sun 15:01]--[2022-01-23 Sun 15:26] =>  0:25
CLOCK: [2022-01-23 Sun 12:14]--[2022-01-23 Sun 12:39] =>  0:25
CLOCK: [2022-01-23 Sun 11:14]--[2022-01-23 Sun 11:39] =>  0:25
CLOCK: [2022-01-23 Sun 10:44]--[2022-01-23 Sun 11:09] =>  0:25
:END:
全然テストがないので追加する。
** TODO CIテストする
ライブラリがバグってる問題をどうにかしないとCIでテストできない。
** TODO Rubocop追加する
:LOGBOOK:
CLOCK: [2022-01-30 Sun 23:54]--[2022-01-31 Mon 00:19] =>  0:25
:END:
** TODO パッケージ公開する
すぐに使える状態にしておくのはいいことだ。
同じ名前のgemがあってgemfilesには登録できないので、[[id:6b889822-21f1-4a3e-9755-e3ca52fa0bc4][GitHub]]にパッケージを登録しておく。
** TODO 依存してるパーサがバグってる問題を直す
文法エラーだからオーバーライドもできない。
vendorに持ってきて修正するか、自前でパーサを書く。本の続きにはパーサコードがあるので、それをやってみるのがいいか。
** TODO 一行で書けない問題を直す
一行ずつevalしないと評価されない。別のスコープになっているようだ。
** TODO おみくじが書けるようにする
おみくじを書くのに必要なことをまとめ、解決する。
* Reference
* Archives
