20220129113922-risp.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-13 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>risp</title>
<meta name="generator" content="Org mode">
<meta name="author" content="root">
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content">
<h1 class="title">risp</h1>
<div id="outline-container-org5cedaab" class="outline-2">
<h2 id="org5cedaab"><a href="#org5cedaab">概要</a></h2>
<div class="outline-text-2" id="text-org5cedaab">
<p>
eccentric projectのコードを元に、Ruby上でLispを実装する。
最低限かつテストがないので、整備して使えるようにする。
</p>

<p>
ゴール: おみくじスクリプトを書けるようにする。
</p>
</div>
</div>
<div id="outline-container-orgf17a69b" class="outline-2">
<h2 id="orgf17a69b"><a href="#orgf17a69b">Memo</a></h2>
</div>
<div id="outline-container-org02aac4a" class="outline-2">
<h2 id="org02aac4a"><a href="#org02aac4a">Tasks</a></h2>
<div class="outline-text-2" id="text-org02aac4a">
</div>
<div id="outline-container-org9154eed" class="outline-3">
<h3 id="org9154eed"><a href="#org9154eed"><span class="todo TODO">TODO</span> <a href="https://tatsu-zine.com/samples/free/scheme-in-ruby.pdf">作って学ぶプログラミング言語</a></a></h3>
<div class="outline-text-3" id="text-org9154eed">
<p>
RubyでSchemeを実装する。
</p>
</div>
</div>
<div id="outline-container-orge907dc5" class="outline-3">
<h3 id="orge907dc5"><a href="#orge907dc5"><span class="todo TODO">TODO</span> 既存部分のテスト追加する</a></h3>
<div class="outline-text-3" id="text-orge907dc5">
<p>
全然テストがないので追加する。
</p>
</div>
</div>
<div id="outline-container-org4b8f5b7" class="outline-3">
<h3 id="org4b8f5b7"><a href="#org4b8f5b7"><span class="todo TODO">TODO</span> CIテストする</a></h3>
<div class="outline-text-3" id="text-org4b8f5b7">
<p>
ライブラリがバグってる問題をどうにかしないとCIでテストできない。
</p>
</div>
</div>
<div id="outline-container-orgde877a6" class="outline-3">
<h3 id="orgde877a6"><a href="#orgde877a6"><span class="todo TODO">TODO</span> Rubocop追加する</a></h3>
<div class="outline-text-3" id="text-orgde877a6">
</div>
</div>
<div id="outline-container-org2b0a782" class="outline-3">
<h3 id="org2b0a782"><a href="#org2b0a782"><span class="todo TODO">TODO</span> パッケージ公開する</a></h3>
<div class="outline-text-3" id="text-org2b0a782">
<p>
すぐに使える状態にしておくのはいいことだ。
同じ名前のgemがあってgemfilesには登録できないので、<a href="20210926103926-github.html#ID-6b889822-21f1-4a3e-9755-e3ca52fa0bc4">GitHub</a>にパッケージを登録しておく。
</p>
</div>
</div>
<div id="outline-container-org5243170" class="outline-3">
<h3 id="org5243170"><a href="#org5243170"><span class="todo TODO">TODO</span> 依存してるパーサがバグってる問題を直す</a></h3>
<div class="outline-text-3" id="text-org5243170">
<p>
文法エラーだからオーバーライドもできない。
vendorに持ってきて修正するか、自前でパーサを書く。本の続きにはパーサコードがあるので、それをやってみるのがいいか。
</p>
</div>
</div>
<div id="outline-container-org17f2745" class="outline-3">
<h3 id="org17f2745"><a href="#org17f2745"><span class="todo TODO">TODO</span> 一行で書けない問題を直す</a></h3>
<div class="outline-text-3" id="text-org17f2745">
<p>
一行ずつevalしないと評価されない。別のスコープになっているようだ。
</p>
</div>
</div>
<div id="outline-container-orgd41f7aa" class="outline-3">
<h3 id="orgd41f7aa"><a href="#orgd41f7aa"><span class="todo TODO">TODO</span> おみくじが書けるようにする</a></h3>
<div class="outline-text-3" id="text-orgd41f7aa">
<p>
おみくじを書くのに必要なことをまとめ、解決する。
</p>
</div>
</div>
</div>
<div id="outline-container-orge3857ea" class="outline-2">
<h2 id="orge3857ea"><a href="#orge3857ea">Reference</a></h2>
</div>
<div id="outline-container-org51a317e" class="outline-2">
<h2 id="org51a317e"><a href="#org51a317e">Archives</a></h2>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
